using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace 棋牌.成都麻将
{
    partial class 成都麻将
    {
        public static readonly int 牌数组张数 = 108;
        /// <summary>
        /// 成都麻将的 108 张牌的所有数据
        /// </summary>
        public static 牌[] 牌数组 = new 牌[] {
            // 1 ~ 9 筒 x 4 张
            牌枚举.一筒, 牌枚举.二筒, 牌枚举.三筒, 牌枚举.四筒, 牌枚举.五筒, 牌枚举.六筒, 牌枚举.七筒, 牌枚举.八筒, 牌枚举.九筒,
            牌枚举.一筒, 牌枚举.二筒, 牌枚举.三筒, 牌枚举.四筒, 牌枚举.五筒, 牌枚举.六筒, 牌枚举.七筒, 牌枚举.八筒, 牌枚举.九筒,
            牌枚举.一筒, 牌枚举.二筒, 牌枚举.三筒, 牌枚举.四筒, 牌枚举.五筒, 牌枚举.六筒, 牌枚举.七筒, 牌枚举.八筒, 牌枚举.九筒,
            牌枚举.一筒, 牌枚举.二筒, 牌枚举.三筒, 牌枚举.四筒, 牌枚举.五筒, 牌枚举.六筒, 牌枚举.七筒, 牌枚举.八筒, 牌枚举.九筒,
            // 1 ~ 9 条 x 4 张
            牌枚举.一条, 牌枚举.二条, 牌枚举.三条, 牌枚举.四条, 牌枚举.五条, 牌枚举.六条, 牌枚举.七条, 牌枚举.八条, 牌枚举.九条,
            牌枚举.一条, 牌枚举.二条, 牌枚举.三条, 牌枚举.四条, 牌枚举.五条, 牌枚举.六条, 牌枚举.七条, 牌枚举.八条, 牌枚举.九条,
            牌枚举.一条, 牌枚举.二条, 牌枚举.三条, 牌枚举.四条, 牌枚举.五条, 牌枚举.六条, 牌枚举.七条, 牌枚举.八条, 牌枚举.九条,
            牌枚举.一条, 牌枚举.二条, 牌枚举.三条, 牌枚举.四条, 牌枚举.五条, 牌枚举.六条, 牌枚举.七条, 牌枚举.八条, 牌枚举.九条,
            // 1 ~ 9 万 x 4 张
            牌枚举.一万, 牌枚举.二万, 牌枚举.三万, 牌枚举.四万, 牌枚举.五万, 牌枚举.六万, 牌枚举.七万, 牌枚举.八万, 牌枚举.九万,
            牌枚举.一万, 牌枚举.二万, 牌枚举.三万, 牌枚举.四万, 牌枚举.五万, 牌枚举.六万, 牌枚举.七万, 牌枚举.八万, 牌枚举.九万,
            牌枚举.一万, 牌枚举.二万, 牌枚举.三万, 牌枚举.四万, 牌枚举.五万, 牌枚举.六万, 牌枚举.七万, 牌枚举.八万, 牌枚举.九万,
            牌枚举.一万, 牌枚举.二万, 牌枚举.三万, 牌枚举.四万, 牌枚举.五万, 牌枚举.六万, 牌枚举.七万, 牌枚举.八万, 牌枚举.九万,
        };
    }
}
